Repository: tellurianinteractive/Tellurian.Trains.Schedule.Importers
Catalog: Importers.Xpln/Importers/Resources/Strings.*.resx
Languages: da, de, no, sv

source: Cannot read schedule due to errors in timetable.
da: Kan ikke indlæse tjenesterne grundet fejl i køreplanen.
de: Umlaufpläne können aufgrund von Fehlern im Fahrplan nicht gelesen werden.
no: Kan ikke innlese jobber grundet feil i kjøreplanen.
sv: Kan inte läsa in tjänsterna på grund av fel i tidtabellen.

source: Cannot read timetable due to errors in layout.
da: Kan ikke indlæse køreplanen grundet fejl i banelayoutet.
de: Fahrpläne kann wegen Fehlern im Layout nicht gelesen werden.
no: Kan ikke innlese kjøreplanen grundet feil i banelayoutet.
sv: Kan inte läsa in tidtabellen på grund av fel i banans layout.

# FeatureIsNotSupported
source: Feature {0} is not supported.
da: Funktion {0} er ikke supporteret.
de: Funktion {0} wird nicht unterstützt.
no: Funksjon {0} er ikke supporteret.
sv: Funktion {0} understöds inte.

# ObjectAtStationWithArrivalDoNotRefersToAnExistingTimeInTrain
source: Row {0}: Object '{1}' at station {2} with arrival {3} refers to a non existing time in train {4}.
da: Række {0}: Objekt '{1}' ved station {2} ank {3} refererer til en tid der ikke findes i tog {4}.
de: Reihe {0}: Objekt '{1}' am Bahnhof {2} mit Ankunft {3} verweist auf eine nicht existierende Zeit in Zug {4}.
no: Rad {0}: Objekt '{1}' ved stasjon {2} ank {3} refererer til en tid der ikke finnes i tog {4}.
sv: Rad {0}: Objekt '{1}' vid station {2} ank {3} refererar till en tid som inte finns i tåg {4}.

# ObjectAtStationWithDepartureDoNotRefersToAnExistingTimeInTrain
source: Row {0}: Object '{1}' at station {2} with departure {3} refers to a non existing time in train {4}.
da: Række {0}: Objekt '{1}' ved station {2} afg {3} refererer til en tid der ikke findes i tog {4}.
de: Reihe {0}: Objekt '{1}' am Bahnhof {2} mit Abfahrt {3} verweist auf eine nicht existierende Zeit in Zug {4}.
no: Rad {0}: Objekt '{1}' ved stasjon {2} avg {3} refererer til en tid der ikke finnes i tog {4}.
sv: Rad {0}: Objekt '{1}' vid station {2} avg {3} refererar till en tid som inte finns i tåg {4}.

# ObjectInTrainHasWrongTimingEndStartionIsBeforeStartStation
source: Row {0}: Object '{1}' in train {2} has wrong timing. Departure {3} is before arrival {4}.
da: Række {0}: Objekt '{1}' i tog {2} har tider i forkert rækkefølge. Afgang {3} er inden ankomst {4}.
de: Reihe {0}: Objekt '{1}' in Zug {2} hat falsches Timing. Abfahrt {3} ist vor Ankunft {4}.
no: Rad {0}: Objekt '{1}' i tog {2} har tider i feil rekkefølge. Ankomst {3} er innen avgang {4}.
sv: Rad {0}: Objekt '{1}' i tåg {2} har tider i fel ordning. Avgång {3} är innan ankomst {4}.

source: Warning
da: Advarsel
de: Warnung
no: Advarsel
sv: Varning

source: Error
da: Fejl
de: Fehler
no: Feil
sv: Fel

# TrainHasNoCallsAtStation
source: Row {0}: Train {1} does not pass station {2}.
da: Række {0}: Tog {1} passerer ikke station {2}.
de: Reihe {0}: Zug {1} passiert Bahnhof {2} nicht.
no: Rad {0}: Tog {1} passerer ikke stasjon {2}.
sv: Rad {0}: Tåg {1} passerar inte station {2}.

# WorksheetNotFound
source: Worksheet {0} not found.
da: Arbejdsark {0} blev ikke fundet.
de: Arbeitsblatt {0} nicht gefunden.
no: Finner ikke regnearket {0}.
sv: Kalkylbladet {0} hittades inte.

# UnsupportedType
source: Row {0}: Type {1} is not supported. Please, contact developer if you are missing a type.
da: Række {0}: Type {1} understøttes ikke. Kontakt venligst udvikleren, hvis du mangler en type.
de: Reihe {0}: Type {1} wird nicht unterstützt. Bitte wenden Sie sich an den Entwickler, wenn Ihnen ein Typ fehlt.
no: Rad {0}: Type {1} støttes ikke. Ta kontakt med utvikleren hvis du mangler en type.
sv: Rad {0}: Type {1} stöds inte. Vänligen kontakta utvecklaren om du saknar en typ.

# NotAllFieldsArePresent
source: Row {0}: Not all fields present, expected count is {1}, actual count is {2}.
da: Række {0}: Ikke alle felter er til stede, forventet antal er {1}, faktisk antal er {2}.
de: Reihe {0}: Nicht alle Felder vorhanden, erwartete Anzahl ist {1}, tatsächliche Anzahl ist {2}.
no: Rad {0}: Ikke alle felt er til stede, forventet antall er {1}, faktisk antall er {2}.
sv: Rad {0}: Alla fält är inte närvarande, förväntat antal är {1}, faktisk antal är {2}.

# UseLoco
source: Use loco {0}.
da: Brug lok {0}.
de: Benutze Lok {0}.
no: Bruk lok {0}.
sv: Använd lok {0}.

# UseLocoClasses
source: Use loco {0}, classes {1}.
da: Brug lok {0}, type {1}.
de: Benutze Lok {0}, Klasse {1}.
no: Bruk lok {0}, type {1}.
sv: Använd lok {0}, littera {1}.

# TrainHasOverlappingTimesAtStation
source: Row {0}: Train {1} has overlapping times at {2}.
da: Række {0}: Tog {1} har overlappende tider ved {2}.
de: Reihe {0}: Zug {1} hat sich überschneidende Zeiten bei {2}.
no: Rad {0}: Tog {1} har overlappende tider på {2}.
sv: Rad {0}: Tåg {1} har överlappande tider vid {2}.

# ColumnMustHaveAValue
source: Row {0}: Column {1} must contain a value.
da: Række {0}: Kolonne {1} skal indeholde en værdi.
de: Reihe {0}: Spalte {1} muss einen Wert enthalten.
no: Rad {0}: Kolonne {1} må inneholde en verdi.
sv: Rad {0}: Kolumn {1} måste innehålla ett värde.

# UnsupportedSubType
source: Row {0}: SubType {1} is not supported. Please, contact developer if you are missing a type.
da: Række {0}: SubType {1} understøttes ikke. Kontakt venligst udvikleren, hvis du mangler en type.
de: Reihe {0}: SubType {1} wird nicht unterstützt. Bitte wenden Sie sich an den Entwickler, wenn Ihnen ein Typ fehlt.
no: Rad {0}: SubType {1} støttes ikke. Ta kontakt med utvikleren hvis du mangler en type.
sv: Rad {0}: SubType {1} stöds inte. Vänligen kontakta utvecklaren om du saknar en typ.

# ColumnMustBeANumber
source: Row {0}: Column {1} must contain a number, current value is '{2}'.
da: Række {0}: Kolonne {1} skal indeholde et tal, den aktuelle værdi er {2}.
de: Reihe {0}: Spalte {1} muss eine Zahl enthalten, aktueller Wert ist '{2}'.
no: Rad {0}: Kolonne {1} må inneholde et tall, gjeldende verdi er {2}.
sv: Rad {0}: Kolumn {1} måste innehålla ett tal, nuvarande värde är {2}.

# ColumnIsNotSpecified
source: Row {0}: Column {1} is not specified.
da: Række {0}: Kolonne {1} er ikke angivet.
de: Reihe {0}: Spalte {1} ist nicht angegeben.
no: Rad {0}: Kolonne {1} er ikke spesifisert.
sv: Rad {0}: Kolumn {1} är inte angiven.

# ColumnMustBeATime
source: Row {0}: Column {1} must be a time, current value is '{2}'.
da: Række {0}: Kolonne {1} skal være et tidspunkt, den aktuelle værdi er {2}.
de: Reihe {0}: Spalte {1} muss eine Zeit sein, aktueller Wert ist '{2}'.
no: Rad {0}: Kolonne {1} må være et tidspunkt, gjeldende verdi er {2}.
sv: Rad {0}: Kolumn {1} måste vara en tid, nuvarande värde är {2}.

# TrainHasNoCalls
source: Row {0}: Train {1} has no times at stations.
da: Række {0}: Tog {1} har ingen gange på stationer.
de: Reihe {0}: Zug {1} hat keine Zeiten an der Station.
no: Rad {0}: Tog {1} har ingen tider på stasjoner.
sv: Rad {0}: Tåg {1} har inga tider på stationer.

# StationNotFoundInLayout
source: Row {0}: Station '{1}' not found in current layout.
da: Række {0}: Station '{1}' blev ikke fundet i det aktuelle layout.
de: Reihe {0}: Station '{1}' im aktuellen Layout nicht gefunden.
no: Rad {0}: Stasjon '{1}' ikke funnet i gjeldende layout.
sv: Rad {0}: Station '{1}' hittades inte i nuvarande layout.

# RouteNotFoundInLayout
source: Row {0}: Route '{1}' not found in current layout.
da: Række {0}: Rute '{1}' blev ikke fundet i det aktuelle layout.
de: Reihe {0}: Route „{1}“ im aktuellen Layout nicht gefunden.
no: Rad {0}: Ruten '{1}' ikke funnet i gjeldende layout.
sv: Rad {0}: Rutten'{1}' ej funnen i aktuell banlayout.

# RouteNumberIsMissingUsingDefault
source: Row {0}: Route number missing, using default '{1}'.
da: Række {0}: Rutenummer mangler, bruger standardværdi '{1}'.
de: Zeile {0}: Routennummer fehlt, Standardwert „{1}“ wird verwendet.
sv: Rad {0}: Ruttnummer saknas, med standardvärde '{1}'.

# ReadingWorksheet
source: Reading worksheet {0}...
da: Læser arbejdsark {0}...
de: Arbeitsblatt {0} wird gelesen...
sv: Läser arbetsblad {0}...

# RowMessage
source: Row {0}: {1}.
da: Række {0}: {1}.
de: Reihe {0}: {1}.
sv: Rad {0}: {1}.

# ThereIsNoStation
source: There is no station '{0}'.
da: Der er ingen station '{0}'.
de: Es gibt keine Station '{0}'.
sv: Det finns ingen station '{0}'.

# TheTrackIsItNotInStation
source: Track '{0}' is not in station '{1}'.
da: Sporet '{0}' er ikke på stationen '{1}'.
de: Gleis '{0}' ist nicht in Station '{1}'.
sv: Spåret '{0}' finns inte på stationen '{1}'.

source: Information
no: Informasjon
