Repository: tellurianinteractive/Tellurian.Trains.Schedule.Importers
Catalog: Importers.Model/Model/Resources/Strings.*.resx
Languages: da, de, no, sv

# ArrivalIsAfterDeparture
source: At {0} arrival {1} is after departure {2}.
da: Ved {0} ankomst {1} er senere end afgang {2}.
de: Bei {0} ist Ankunft {1} nach Abfahrt {2}.
no: Ved {0} ankomst {1} er senere end avgang {2}.
sv: Vid {0} är ankomsttid {1} är senare än avgångstid {2}.

# CallAtStationHasConflictsWithOtherCall
source: Train {0} {1} has conflicts with train {2} {3}.
da: Tog {0} {1} er i konflikt med tog {2} {3}.
de: Zug {0} {1} hat Konflikte mit Zug {2} {3}.
no: Tog {0} {1} er i konflikt med tog {2} {3}.
sv: Tåg {0} {1} är i konflikt med tåg {2} {3}.

# CallMustBeAfterPreviousCall
source: Call {0} must be after previous call {1} for train {2}.
da: Anløb {0} skal være senere en foregående anløb {1} for tog {2}.
de: Das Überholen von {0} muss nach dem vorherigen Überholen von {1} für Zug {2} erfolgen.
no: Anløp {0} skal være senere en foregående anløp {1} for tog {2}.
sv: Angöring {0} måste vara senare än föregående {1} för tåg {2}.

# ConflictOnStretchBetweenPassingTrains
source: Conflict on stretch {0} between {1} and {2}.
da: Konflikt på strækningen {0} mellem {1} og {2}.
de: Das Passieren bei {0} muss nach vorherigem Passieren von {1} für Zug {2} erfolgen.
no: Konflikt på strekningen {0} mellom {1} og {2}.
sv: Konflikt på sträckan {0} mellan {1} och {2}.

# DuplicateAddOfStation
source: Duplicate add of station {0}.
da: Dublet tilføjet av station {0}.
de: Doppeltes Hinzufügen von Station {0}.
no: Dublett tilføyet av stasjon {0}.
sv: Dubblett tillagd av station {0}.

# DuplicateTrainInLocoSchedule
source: Duplicate train number {0} in loco schedule {1}.
da: Dublet tog nummer {0} i lokomløb {1}.
de: Doppelte Zugnummer {0} im Lokfahrplan {1}.
no: Dublett tog nummer {0} i lok omløp {1}.
sv: Dubblett tåg nummer {0} i lokomlopp {1}.

# LocoScheduleMustHaveAnIdentity
source: A loco schedule must have an identity.
da: Et lokomløb må ha unik identitet.
de: Ein Lokfahrplan muss eine Identität haben.
no: Ett lokomløp må ha unik identitet.
sv: Ett lokomlopp måste ha en unik identitet.

# MoreThanOneStretchBetweenStations
source: More than one stretch between {0} and {1}.
da: Flere end en sporstrækning mellem {0} og {1}.
de: Mehr als eine Strecke zwischen {0} und {1}.
no: Flere end en sporstrekning mellom {0} og {1}.
sv: Mer än en spårsträcka mellan {0} och {1}.

# NameOfObjectIsRequired
source: Name of {0} is required.
da: Navn for {0} påkræves.
de: Name von {0} ist erforderlich.
no: Navn for {0} påkreves.
sv: Namn för {0} krävs.

# NumberOfObjectIsRequired
source: Number of {0} is required.
da: Nummer for {0} påkræves.
de: Anzahl {0} ist erforderlich.
no: Nummer for {0} påkreves.
sv: Nummer för {0} krävs.

# SignatureOfObjectIsRequired
source: Signature of {0} is required.
da: Signatur for {0} påkræves.
de: Bezeichnung von {0} ist erforderlich.
no: Signatur for {0} påkreves.
sv: Signatur för {0} krävs.

source: Station
de: Bahnhof
no: Stasjon

# StationExitIsNotInLayout
source: Station exit {0} is not in layout.
da: Udkørsel {0} fra station findes ikke i baneplanen.
de: Stationsausfahrt {0} ist nicht im Layout.
no: Utkjørsel {0} fra stasjon finnes ikke i baneplanen.
sv: Stationsutfart {0} finns inte i banplanen.

# StationHasNotTrackNumber
source: Station {0} has no track number {1}.
da: Station {0} har ikke spor nummer {1}.
de: Station {0} hat keine Gleisnummer {1}.
no: Stasjon {0} har ikke spor nummer {1}.
sv: Station {0} har inget spårnummer {1}.

# StretchMayNotStartAndEndAtSameStationExit
source: Stretch may not start and end at the same station exit.
da: Strækningen må ikke starte og slutte på samme udkørsel.
de: Strecken dürfen nicht am selben Bahnhofsausfahrt beginnen und enden.
no: Strekningen må ikke starte og slutte på samme utkjørsel.
sv: Sträckan får inte starta och sluta på samma utfart.

# StretchMayNotStartAndEndAtTheSameStation
source: A stretch may not start and end at the same station {0}.
da: Strækningen må ikke starte og slutte på samme station {0}.
de: Eine Strecke startet und endet nicht an derselben Station {0}.
no: Strekningen må ikke starte og slutte på samme stasjon {0}.
sv: En spårsträcka får inte starta och sluta på samma station {0}.

# StretchToString
source: {0} to {1}
da: {0} til {1}
de: {0} bis {1}
no: {0} til {1}
sv: {0} till {1}

# ThereIsNoStretchBetweenStation1AndStation2
source: There is no stretch between {0} and {1}.
da: Der findes ikke nogen strækning mellem {0} og {1}.
de: Zwischen {0} und {1} gibt es keine Dehnung.
no: Der finnes ikke nogen strekning mellom {0} og {1}.
sv: Det finns ingen sträcka mellan {0} och {1}.

# TheStationNameIsNotPartOfTheStretch
source: The station {0} is not part of the timetable stretch.
da: Station {0} er ikke med på køreplanstrækningen.
de: Der Bahnhof {0} ist nicht Teil des Fahrplanabschnitts.
no: Stasjon {0} er ikke med på kjøreplanstrekningen.
sv: Stationen {0} är inte med på tidtabellsträckan.

source: Timetable stretch
da: Køreplanstrækning
de: Fahrplanabschnitt
no: Kjøreplanstrekning
sv: Tidtabellssträcka

# TrackInStationReferredInTrainIsNotInLayout
source: Track {0} in station {1} referred in train {2} is not in layout.
da: Spor {0} på station {1} for tog {2} findes ikke.
de: Track {0} in Bahnhof {1} in Zug {2} ist nicht im Layout.
no: Spor {0} på stasjon {1} for tog {2} finnes ikke.
sv: Spår {0} på station {1} angiven i tåg {2} saknas i banplanen.

# TrackIsOccupiedByTrainBetween
source: Track {0} in station {1} is occupied by train {2} during {3}.
da: Spor {0} på {1} er belagt af tog {2} under tiden {3}.
de: Gleis {0} in Bahnhof {1} ist während {3} von Zug {2} besetzt.
no: Spor {0} på {1} er belagt av tog {2} under tiden {3}.
sv: Spår {0} på station {1} är upptaget av tåg {2} under tiden {3}.

# TrackStretchIsAlreadyAssignedToExitNameAtStationName
source: Track stretch is already assigned to exit {0} at station {1}.
da: Sporstrækningen er allerede koblet til udkørsel {0} ved {1}.
de: Der Gleisabschnitt ist bereits der Ausfahrt {0} an der Station {1} zugewiesen.
no: Sporstrekningen er allerede koblet til utkjørsel {0} ved {1}.
sv: Spårsträckan är redan kopplad till utfart {0} på {1}.

# CallAtStationTrackDuringTimes
source: at {0} track {1} arr {2} dep {3}
da: ved {0} spor {1} ank {2} afg {3}
de: bei {0} Gleis {1} an {2} ab {3}
no: ved {0} spor {1} ank {2} avg {3}
sv: vid {0} spår {1} ank {2} avg {3}

# TrainHasConflictingCalls
source: Train {0} calls {1} and {2} are conflicting.
da: Tog {0} anløbene {1} og {2} er i konflikt.
de: Zug {0} Zeiten {1} und {2} sind widersprüchlich.
no: Tog {0} anløpene {1} og {2} er i konflikt.
sv: Tåg {0} passagerna {1} och {2} är i konflikt.

# TrainMustHaveMinimumTwoCalls
source: Train {0} must stop at at least two stations.
da: Tog {0} skal standse ved mindst to stationer.
de: Zug {0} muss an mindestens zwei Bahnhöfen halten.
no: Tog {0} må stoppe på minst to stasjoner.
sv: Tåg {0} måste stanna vid minst två stationer.

# TrainSpeedBetweenCallsIsTooFast
source: Train {0} speed from {1} {2} to {3} {4} is too fast, length {5:F1} meters.
da: Hastighed for tog {0} fra {1} {2} til {3} {4} er for høj, længde {5:F1} meter.
de: Zuggeschwindigkeit {0} von {1} {2} nach {3} {4} ist zu schnell, Länge {5:F1} Meter.
no: Hastigheten for tog {0} fra {1} {2} til {3} {4} er for høg, lengde {5:F1} meter.
sv: Hastigheten för tåg {0} från {1} {2} till {3} {4} är för hög, längd {5:F1} meter.

# TrainSpeedBetweenCallsIsTooSlow
source: Train {0} speed from {1} {2} to {3} {4} is too slow, length {5:F1} meters.
da: Hastighed for tog {0} fra {1} {2} til {3} {4} er for lav, længde {5:F1} meter.
de: Zuggeschwindigkeit {0} von {1} {2} nach {3} {4} ist zu langsam, Länge {5:F1} Meter.
no: Hastigheten for tog {0} fra {1} {2} til {3} {4} er for lav, lengde {5:F1} meter.
sv: Hastigheten för tåg {0} från {1} {2} till {3} {4} är för låg, längd {5:F1} meter.

# VehicleScheduleContainsOverlappingTrainParts
source: Vehicle schedule {0} contains overlapping {1} and {2}.
da: Vognløb {0} er overlappende {1} og {2}.
de: Fahrzeugplan {0} enthält überlappende {1} und {2}.
no: Vognløp {0} er overlappende {1} og {2}.
sv: Fordonsomlopp {0} är överlappande {1} och {2}.

source: Warning
da: Advarsel
de: Warnung
no: Advarsel
sv: Varning

source: Error
da: Fejl
de: Fehler
no: Feil
sv: Fel

source: Information
no: Informasjon

# ThereIsNoFromStationWithSignatureOrName
source: There is no from-station with signature or name {0}.
da: Der er ikke nogen fra-station med signatur eller navn {0}.
de: Es gibt keine Von-Station mit Signatur oder Name {0}.
no: Der er ikke noen fra-stasjon med signatur eller navn {0}.
sv: Det finns ingen från-station med signatur eller namn {0}.

# ThereIsNoStationWithNameOrSignature
source: There is no station with name or signature {0}.
da: Der er ikke nogen station med signatur eller navn {0}.
de: Es gibt keine Station mit Namen oder Bezeichnung {0}.
no: Der er ikke noen stasjon med signatur eller navn {0}.
sv: Det finns ingen station med signatur eller namn {0}.

# ThereIsNoToStationWithSignatureOrName
source: There is no to-station with signature or name {0}.
da: Der er ikke nogen til-station med signatur eller navn {0}.
de: Es gibt keine Zielstation mit Signatur oder Name {0}.
no: Der er ikke noen til-stasjon med signatur eller navn {0}.
sv: Det finns ingen till-station med signatur eller namn {0}.

source: Signature of station is required.
da: Signatur for station påkræves.
de: Stationsbezeichnung erforderlich.
no: Signatur for stasjon påkreves.
sv: Signatur för station krävs.

# MaxLengthIs5
source: Max length is 5 characters.
da: Maks længde er 5 tegn.
de: Die maximale Länge beträgt 5 Zeichen.
no: Maks lengde er 5 tegn.
sv: Max längd är 5 tecken.

# MaxLengthIs50
source: Max length is 50 characters.
da: Maks længde er 50 tegn.
de: Die maximale Länge beträgt 50 Zeichen.
no: Maks lengde er 50 tegn.
sv: Max längd är 50 tecken.

# NoValue
source: Value is missing.
da: Værdi mangler.
de: Wert fehlt.
no: Verdi mangler.
sv: Värde saknas.

# TrainBetweenPassingIsConflictingWithTrainBetweenPassing
source: Train {0} between {1} is conflicting with train {2} between {3}.
da: Tog {0} mellem {1} er i konflikt med tog {2} mellem {3}.
de: Zug {0} zwischen {1} steht in Konflikt mit Zug {2} zwischen {3}.
no: Tog {0} mellom {1} er i konflikt med tog {2} mellom {3}.
sv: Tåg {0} mellan {1} är i konflikt med tåg {2} mellan {3}.
